export default {
  confirmBuyingResource: {
    title: "",
    content: `구매 시 사용한 포인트는 환불이 불가능하니 
미리보기와 내용, 댓글을 확인한 후 구매해 주세요.
    
자료를 무단으로 가공 및 유통, 재판매하는
경우 이용에 제한이 생길 수 있습니다.`,
  },
  notLoggedIn: {
    title: "로그인 후 이용 가능한 서비스입니다.",
    content: "로그인하러 가시겠습니까?",
  },
  30: {
    title: "신고 과정에서 문제가 발생하였습니다.",
    content: "해당 게시글 혹은 자료가 존재하지 않습니다.",
  },
  33: {
    title: "신고 과정에서 문제가 발생하였습니다.",
    content: "이미 신고한 기록이 있습니다.",
  },
  32: {
    title: "구매 과정에서 문제가 발생하였습니다.",
    content: "point가 부족합니다.",
  },
  42: {
    title: "구매 과정에서 문제가 발생하였습니다.",
    content: "이미 구입한 강의자료입니다.",
  },
  43: {
    title: "구매 과정에서 문제가 발생하였습니다.",
    content: "자신의 강의자료는 구매할 수 없습니다.",
  },
  notDefinedError: {
    title: "문제가 발생하였습니다.",
    content: "알 수 없는 오류로 요청이 실패하였습니다. 관리자에게 문의하세요.",
  },
};
